Revit 2024 API
Wire.RemoveVertex Method
 Removes the vertex corresponding to the specified index. Can not remove the start or end vertex if it already connects to other element.
Namespace: Autodesk.Revit.DB.Electrical
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2015
Syntax
C#
public void RemoveVertex(
	int index
)
Visual Basic
Public Sub RemoveVertex ( _
	index As Integer _
)
Visual C++
public:
void RemoveVertex(
	int index
)
Parameters
index
Type: System.Int32
 The index which should be in [0, NumberOfVertices).
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentException |  The index should be between 0 and the number of vertices of the wire.
Autodesk.Revit.Exceptions.DisabledDisciplineException |  None of the following disciplines is enabled: Mechanical Electrical Piping.
Autodesk.Revit.Exceptions.InvalidOperationException |  The wire has only 2 vertices, so one cannot be removed. -or- Can't remove the vertex when the vertex is start or end point and the wire connects to one element.
See Also
Wire Class
Autodesk.Revit.DB.Electrical Namespace